devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP128GM706/boardcfg_128GM706.h
/* *****************************************************************************
 * File:   boardcfg.h
 * Author: Dimitar Lilov
 *
 * Created on 2019 01 23 14:49
 * 
 * Description: Board Configuration
 * 
 **************************************************************************** */


/* Guard condition file contents not included more than once */  
#ifndef BOARDCFG_H
#define	BOARDCFG_H

/* *****************************************************************************
 * Header Includes
 **************************************************************************** */
#include <xc.h>
#include "projectcfg.h"
#include "mcc_cfg.h"

/* *****************************************************************************
 * Board Variation
 **************************************************************************** */
#define BOADRCFG_VARIANT_EXT_MEM 0      /* Board With SPI */
#define BOADRCFG_VARIANT_NO_EXT_MEM 1   /* Board Without SPI */

#define BOADRCFG_VARIANT    BOADRCFG_VARIANT_NO_EXT_MEM


/* *****************************************************************************
 * Configuration Definitions - Driver Modules
 **************************************************************************** */
#define BOARDCFG_USE_UART_1     1
#define BOARDCFG_USE_UART_2     0
#define BOARDCFG_USE_UART_3     0
#define BOARDCFG_USE_UART_4     0

#define BOARDCFG_USE_SPI_1      1
#define BOARDCFG_USE_SPI_2      1
#define BOARDCFG_USE_SPI_3      0
#define BOARDCFG_USE_SPI_4      0

#define BOARDCFG_USE_I2C_1      1
#define BOARDCFG_USE_I2C_2      1


/* *****************************************************************************
 * NON_MCC DEBUG PINs
 **************************************************************************** */
#define ICD_PGD1 0
#define ICD_PGD2 1
#define ICD_PGD3 2

#define BOARDCFG_DEBUG ICD_PGD1

/* *****************************************************************************
 * Configuration Definitions
 **************************************************************************** */
#define BOARDCFG_CSMON_PROCESS_CALL_HMLIB               0

#define BOARDCFG_RW_NON_VOLATILE_MEMORY_SIZE_EEPROM_KB  PROJECTCFG_RW_NON_VOLATILE_MEMORY_SIZE_EEPROM_KB

#define BOARDCFG_USE_ANDREAS_INTERFACE_RTC              0
#define BOARDCFG_USE_ANDREAS_SCI_INIT                   0

#define BOARDCFG_MODBUSREG_USE_CONTROL                  1

/* MODBUS READ SERVER ID */
#define BOARDCFG_VENDORID_BYTE0     'T'
#define BOARDCFG_VENDORID_BYTE1     'D'
#define BOARDCFG_VENDORID_BYTE2     'B'
#define BOARDCFG_VENDORID_BYTE3     '-'
#define BOARDCFG_PRODUCTID_BYTE0    'P'
#define BOARDCFG_PRODUCTID_BYTE1    '4'
#define BOARDCFG_PRODUCTID_BYTE2    '.'
#define BOARDCFG_PRODUCTID_BYTE3    '2'

#define BOARDCFG_SERIALNUM_BYTE0    0x11
#define BOARDCFG_SERIALNUM_BYTE1    0x22
#define BOARDCFG_SERIALNUM_BYTE2    0x33
#define BOARDCFG_SERIALNUM_BYTE3    0x44
#define BOARDCFG_SERIALNUM_BYTE4    0x55
#define BOARDCFG_SERIALNUM_BYTE5    0x66
#define BOARDCFG_SERIALNUM_BYTE6    0x77
#define BOARDCFG_SERIALNUM_BYTE7    0x88

#define BOARDCFG_SERVERID_NUMBER    0x00
#define BOARDCFG_SERVERID_LENGTH    16

#define BOARDCFG_VENDOR_NAME            "XXXXXXXX"
#define BOARDCFG_PRODUCT_CODE           "TDB"
#define BOARDCFG_MAJOR_MINOR_REVISION   "4.2"
#define BOARDCFG_VENDOR_URL             "www.xxxxxxxx.bg"
#define BOARDCFG_PRODUCT_NAME           "TDB-P4.2"
#define BOARDCFG_MODEL_NAME             "TDB-P4.2-XX"
#define BOARDCFG_USERAPPLICATION_NAME   "TestStandControl"
#define BOARDCFG_USERRESERVE0_NAME      "Reserve0"
#define BOARDCFG_USERRESERVE1_NAME      "Reserve1"
#define BOARDCFG_USERRESERVE2_NAME      "Reserve2"


#define MODBUSREG_DEVICE_ID_VENDORNAME_LENGTH 16
#define MODBUSREG_DEVICE_ID_PRODUCTCODE_LENGTH 16
#define MODBUSREG_DEVICE_ID_MAJORMINORREVISION_LENGTH 16
#define MODBUSREG_DEVICE_ID_VENDORURL_LENGTH 16
#define MODBUSREG_DEVICE_ID_PRODUCTNAME_LENGTH 16
#define MODBUSREG_DEVICE_ID_MODELNAME_LENGTH 16
#define MODBUSREG_DEVICE_ID_USERAPPLICATIONNAME_LENGTH 16
#define MODBUSREG_DEVICE_ID_USERRESERVE0_LENGTH 16
#define MODBUSREG_DEVICE_ID_USERRESERVE1_LENGTH 16
#define MODBUSREG_DEVICE_ID_USERRESERVE2_LENGTH 16


/* *****************************************************************************
 * Configuration Definitions UART
 **************************************************************************** */
#if defined __dsPIC33EP128GM706__
#define UART1_IsTxReady() (UART1_TransmitBufferIsFull() == 0)
#define UART2_IsTxReady() (UART2_TransmitBufferIsFull() == 0)
#define UART3_IsTxReady() (UART3_TransmitBufferIsFull() == 0)
#define UART4_IsTxReady() (UART4_TransmitBufferIsFull() == 0)

#define UART1_IsRxReady() (UART1_ReceiveBufferSizeGet() >  0)
#define UART2_IsRxReady() (UART2_ReceiveBufferSizeGet() >  0)
#define UART3_IsRxReady() (UART3_ReceiveBufferSizeGet() >  0)
#define UART4_IsRxReady() (UART4_ReceiveBufferSizeGet() >  0)

#define UART1_IsTxDone()  ((UART1_TransferStatusGet() & UART1_TRANSFER_STATUS_TX_EMPTY) > 0)
#define UART2_IsTxDone()  ((UART2_TransferStatusGet() & UART2_TRANSFER_STATUS_TX_EMPTY) > 0)
#define UART3_IsTxDone()  ((UART3_TransferStatusGet() & UART3_TRANSFER_STATUS_TX_EMPTY) > 0)
#define UART4_IsTxDone()  ((UART4_TransferStatusGet() & UART4_TRANSFER_STATUS_TX_EMPTY) > 0)
#endif

/* *****************************************************************************
 * Configuration Definitions FPGA Pin
 **************************************************************************** */

#define BOARDCFG_FPGA_RESET()           {FPGA_RST_SetHigh();}
#define BOARDCFG_FPGA_RESET_RELEASE()   {FPGA_RST_SetLow(); }

#define BOARDCFG_FPGA_ENABLE_PWM()      {EN1_SetHigh();}
#define BOARDCFG_FPGA_DISABLE_PWM()     {EN1_SetLow(); }

/* *****************************************************************************
 * Configuration Definitions TESTPROC IO
 **************************************************************************** */

#define BOARDCFG_USE_TSC_SMALL_RELAY_IO_CONFIGURATION   0     /* 0 - means use dummy IO */


/* *****************************************************************************
 * Configuration Definitions Optimize Functionality Disable 
 **************************************************************************** */
#define BOARDCFG_USE_INFO_CALC_MIN_MAX_AVG              0



/* *****************************************************************************
 * Configuration Definitions Global
 **************************************************************************** */

#define BOARDCFG_STACK_COUNT                        1

