devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP128GM706/boardcfg_128GM706.h
#define BOARDCFG_USE_TEMPERATURE_MEASUREMENT_TRIP   1

#define BOARDCFG_USE_DAC_AUTOMATION 0
 
#define BOARDCFG_USE_TIMER_AND_UART_FUNCTIONALITY   1

#define BOARDCFG_USE_FPGA       1      

#define BOARDCFG_USE_FPGA_TRIP  0		/* Gate Driver Error and Detection included */

#define BOARDCFG_USE_FPGA_DIO   0

#define BOARDCFG_USE_FPGA_PWM   0

#define BOARDCFG_USE_DIO        0       /* use IO processing - mainly in main loop */

#define BOARDCFG_USE_DAC_TRIP   0

#define BOARDCFG_USE_TESTPROC   1

#define BOARDCFG_USE_TSC_DSPIC  1

#define BOARDCFG_VOLTAGE_STACK1_OFFSET_CALC_AUTO_MANIPULATION   1
 
#define FCY_HZ          		PROJECTCFG_FCY_HZ

#define OSC_HZ                  PROJECTCFG_OSC_HZ

#define USE_DYNAMIC_MEMORY_RD   PROJECTCFG_USE_DYNAMIC_MEMORY
#define USE_DYNAMIC_MEMORY_WR   PROJECTCFG_USE_DYNAMIC_MEMORY

#define USE_DYNAMIC_MEMORY_RW   (USE_DYNAMIC_MEMORY_WR || USE_DYNAMIC_MEMORY_RD)
        
#define HMDRV_MODBUS_BAUD  		PROJECTCFG_HMDRV_MODBUS_BAUD
#define HMDRV_HEXMON_BAUD  		PROJECTCFG_HMDRV_HEXMON_BAUD

#define HMDRV_TX_DELAY          PROJECTCFG_USE_HMDRV_TX_DELAY

#define HMDRV_MODBUS_TX_DELAY   PROJECTCFG_USE_HMDRV_MODBUS_TX_DELAY

#define UART_PARITY_AND_DATA_MODBUS    PROJECTCFG_UART_PARITY_AND_DATA_MODBUS
#define UART_PARITY_AND_DATA_HEXMON    PROJECTCFG_UART_PARITY_AND_DATA_HEXMON

#define UART_STOP_BITS          PROJECTCFG_STOP_BITS  

#define I2C_DEFAULT_MODULE      PROJECTCFG_I2C_DEFAULT_MODULE

#define SPI_DEFAULT_MODE        PROJECTCFG_SPI_DEFAULT_MODE



#ifdef PROJECTCFG_TIMER_MAIN_USEC
#define TIMER_MAIN_USEC         PROJECTCFG_TIMER_MAIN_USEC
#endif

#ifndef TIMER_MAIN_USEC
#define TIMER_MAIN_USEC         100.0
#endif

#define BOARDCFG_START_WITH_CALIBRATION_FIRST_AFTER_RESET   1

#define BOARDCFG_TESTPROC_IO_FBK_EMULATION   0

#define BOARDCFG_UDCL_MIN_PRECHARGE  900  /*  90V (0.1 V Resolution) */
#define BOARDCFG_UDCL_MIN_PRECHARGE_CHECK  (BOARDCFG_UDCL_MIN_PRECHARGE + 100)  /*  90V + 10V (0.1 V Resolution) */
#define BOARDCFG_UDCL_MAX_PRECHARGE 9000  /* 900V (0.1 V Resolution) */

#define BOARDCFG_UDCL_DEF_REQUEST   1000  /* 100V (0.1 V Resolution) */

#define BOARDCFG_PWM_FREQUENCY_HZ    2500            /* Global Set PWM Frequency in Hz (default 2500Hz) */



/* *****************************************************************************
 * CSMON PARAMETERS and DATA TABLES
 **************************************************************************** */

#define BOADRCFG_CSMON_PARAM_LIST_READ_ONLY 1
#define BOADRCFG_CSMON_PARAM_LIST_RW_ADDR   0
#define BOADRCFG_CSMON_PARAM_LIST_RW_SIZE   0
#define BOADRCFG_CSMON_PARAM_NAME_RW_ADDR   0
#define BOADRCFG_CSMON_PARAM_NAME_RW_SIZE   0
#define BOADRCFG_CSMON_PARAM_NUMB_RW_ADDR   0
#define BOADRCFG_CSMON_PARAM_NUMB_RW_SIZE   0
#define BOADRCFG_CSMON_PARAM_STRG_RW_ADDR   0
#define BOADRCFG_CSMON_PARAM_STRG_RW_SIZE   0
#define BOADRCFG_CSMON_PARAM_SAUX_RW_ADDR   0
#define BOADRCFG_CSMON_PARAM_SAUX_RW_SIZE   0
#define BOADRCFG_CSMON_PARAM_RSRV_RW_ADDR   0
#define BOADRCFG_CSMON_PARAM_RSRV_RW_SIZE   0

#define BOADRCFG_MODBUSREG_HOLDREG_ADDR_TABLE_READ_ONLY  BOADRCFG_CSMON_PARAM_LIST_READ_ONLY
#define BOADRCFG_MODBUSREG_HOLDREG_LIST_RW_ADDR 0
#define BOADRCFG_MODBUSREG_HOLDREG_LIST_RW_SIZE 0





/* *****************************************************************************
 * PWM
 **************************************************************************** */
#define PWM_MIN_DUTY_COEF   (0.02F)
#define PWM_MAX_DUTY_COEF   (0.98F)
#define PWM_START_DUTY_COEF (0.50F)

#define FRAC_AMPLITUDE_PWM_MIN_DUTY_COEF   (0.00F)
#define FRAC_AMPLITUDE_PWM_MAX_DUTY_COEF   (1.00F)

/* *****************************************************************************
 * Analog and Not Only Configuration Definitions
 **************************************************************************** */
/* ADC */
#define ADC_RESULT_BITS                     16  /* 12 */

#define DEAD_TIME_CLOCK_FREQ_HZ             (100000000.0F)      /* FPGA Clock 100 MHz */
#define MIN_PULSE_CLOCK_FREQ_HZ             (100000000.0F)      /* FPGA Clock 100 MHz */

#define SPEED_RESOLUTION_HZ                 (0.05F)

#define DAC_RESULT_BITS                     10
#define DAC_REFERENCE_VOLTAGE_VOLTS         (5.0F)

#define CURRENT_SHUNT_RESISTANCE_OHM        (5.0F)                              /* Current Shunt implemented on CS-1021 Board */

#define CURRENT_TRANSFORMER_AMPERES_COEF    (5000.0F / 1.0F)  
#define CURRENT_TRANSFORMER_COEF            (1.0F / 5000.0F)                    /* Used Current Transformer */ 
#define CURRENT_AMP_COEF_CS_1021_BOARD      (51000.0F / 10000.0F)               /* 5.10 (CS-1021 Board) */
#define ANALOG_CONDITIONING_COEF            ((10000.0F +  1600.0F) /  1600.0F)   /* 7.25 (Control Board) */

#define CS_1021_VOLTAGE_10V_TO_REAL_CURRENT_MULT       (CURRENT_TRANSFORMER_AMPERES_COEF / (CURRENT_AMP_COEF_CS_1021_BOARD * CURRENT_SHUNT_RESISTANCE_OHM))



#define ANALOG_CONDITIONING_CONTROL_BOARD    ANALOG_CONDITIONING_COEF     

#define VOLTAGE_MEASURE_BOARD_DIVIDER       ( ((12.0F * 470000.0F) + 30000.0F) / 30000.0F)                  /* 189 V/V */
//#define VOLTAGE_MEASURE_BOARD_DIVIDER       ( ((12.0F * 470000.0F) +  6800.0F) /  6800.0F) /* 830.4117647058824 * 7.25 = 6020.485294117647 */

#define CURRENT_AMPLIFICATION_COEF          (ANALOG_CONDITIONING_CONTROL_BOARD * CS_1021_VOLTAGE_10V_TO_REAL_CURRENT_MULT)
#define POWER_SUPPLY_VOLTAGE_DIVIDER        ( VOLTAGE_MEASURE_BOARD_DIVIDER * ANALOG_CONDITIONING_CONTROL_BOARD) 

#define CURRRENT_TO_VOLTAGE_CS_1021_MULT    ((CURRENT_AMP_COEF_CS_1021_BOARD * CURRENT_SHUNT_RESISTANCE_OHM) / CURRENT_TRANSFORMER_AMPERES_COEF)                                                        /* 0.0051 V/A (51k/10k; 1/5000; 5Ohm) */

#define ADC_RESULT_TO_AMP_IFBK_MULT         (( CURRENT_AMPLIFICATION_COEF * ADC_REFERENCE_VOLTAGE_VOLTS)/((uint32_t)1 << ADC_RESULT_BITS))

/* CURRENT_TRANSFORMER_AMPERES_COEF not included */
#define ADC_RESULT_TO_AMP_IFBK_INPUT_VOLTAGE_MULT ((ANALOG_CONDITIONING_CONTROL_BOARD * ADC_REFERENCE_VOLTAGE_VOLTS)/((uint32_t)1 << ADC_RESULT_BITS))

