devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP128GM706/boardcfg_128GM706.h
/* CS_1021_VOLTAGE_10V_TO_REAL_CURRENT_MULT not included mult with this -> ADC_RESULT_TO_AMP_IFBK_MULT */
#define VOLTAGE_ON_CURRENT_INPUT_TO_AMPERES_MULT    CS_1021_VOLTAGE_10V_TO_REAL_CURRENT_MULT

/*  0,30315554001752068014705882352941                       3,3V          6020,4852941176470588235294117647                  16         */
#define ADC_RESULT_TO_VOLTAGE_MULT          ((ADC_REFERENCE_VOLTAGE_VOLTS * POWER_SUPPLY_VOLTAGE_DIVIDER)/((uint32_t)1 << ADC_RESULT_BITS))

#define ADC_RESULT_TO_VOLTS_DC_MULT	ADC_RESULT_TO_VOLTAGE_MULT    
#define ADC_RESULT_TO_VOLT_LN_MULT	ADC_RESULT_TO_VOLTAGE_MULT    



//compatibility with SCC TI
#define GATE_DRIVER_CURRENT_SENSOR_VOLTAGE_MULT     (1.0F)


//#define CURRENT_FEEDBACK_FIX_MULTIPLIER_CONTROL     (1.0F)
#define CURRENT_FEEDBACK_FIX_MULT_SHIFT_CONTROL     (0)                         /* How Many Times To shift right ADC Value */
//#define CURRENT_FEEDBACK_FIX_MULTIPLIER_STACK1      (1.0F)
#define CURRENT_FEEDBACK_FIX_MULT_SHIFT_STACK1      CURRENT_FEEDBACK_FIX_MULT_SHIFT_CONTROL                         /* How Many Times To shift right ADC Value */
//#define CURRENT_FEEDBACK_FIX_MULTIPLIER_STACK2      (1.0F)
#define CURRENT_FEEDBACK_FIX_MULT_SHIFT_STACK2      CURRENT_FEEDBACK_FIX_MULT_SHIFT_CONTROL                         /* How Many Times To shift right ADC Value */
//#define CURRENT_FEEDBACK_FIX_MULTIPLIER_STACK3      (1.0F)
#define CURRENT_FEEDBACK_FIX_MULT_SHIFT_STACK3      CURRENT_FEEDBACK_FIX_MULT_SHIFT_CONTROL                         /* How Many Times To shift right ADC Value */





    
    //below data to be evaluated and tested
//#define CFBK_AMPERES_PER_VOLT_2400A         (125.0F * (2400.0 / 1000.0)            /* this should be 2400A module and 2000A module */
//#define CFBK_AMPERES_PER_VOLT_1500A         (125.0F * (1500.0 / 1000.0)            /* this should be 1500A module */
//#define CFBK_AMPERES_PER_VOLT_1000A         (125.0F * (1000.0 / 1000.0)            /* this should be 1000A module - same as LSC */
 
#define CFBK_MODULE_NOMINAL_AMPERES         1000   
//#define CFBK_MODULE_NOMINAL_AMPERES         1500   
//#define CFBK_MODULE_NOMINAL_AMPERES         2400   
 
//#define CFBK_AMPERES_PER_VOLT_LSC           (125.0F)            /* this should be 1000A module (ctreader 1,3125 coef) */
//#define CFBK_AMPERES_PER_VOLT_MSC           (187.5F)            /* this should be 1500A module */

#define CFBK_AMPERES_PER_VOLT_BASE_MULT     (float)(125.0 / 1000.0)  //This is Volt Per Amp           
//#define CFBK_AMPERES_PER_VOLT_BASE(x)       ((125.0F * x) / 1000.0)             
#define CFBK_AMPERES_PER_VOLT_BASE(x)       (x / 8)             /* same as above */     
    
//#define CFBK_AMPERES_PER_VOLT_DEF           (CFBK_AMPERES_PER_VOLT_LSC)
#define CFBK_AMPERES_PER_VOLT_DEF           CFBK_AMPERES_PER_VOLT_BASE(CFBK_MODULE_NOMINAL_AMPERES)


                                 /* degrees at 10V     1V      */ 
#define TFBK_DEGREES_PER_VOLT_DEF           ((115.0 - 30.0) / (10.0 - 1.0))
    
#define TFBK_OFFSET_DEGREES                 (30.0 - TFBK_DEGREES_PER_VOLT_DEF)

    
#define ADC_RESULT_TO_AMP_CFBK_MULT     ( (CFBK_AMPERES_PER_VOLT_DEF * ANALOG_CONDITIONING_CONTROL_BOARD) * ((ADC_REFERENCE_VOLTAGE_VOLTS)/((uint32_t)1 << ADC_RESULT_BITS)) )   
    
#define ADC_RESULT_TO_AMP_CFBK_MULT_BASE_1_AMPERE     ( (ANALOG_CONDITIONING_CONTROL_BOARD) * ((ADC_REFERENCE_VOLTAGE_VOLTS)/((uint32_t)1 << ADC_RESULT_BITS)) )   /* 1 Volt on Input Connector */
    
#define ADC_RESULT_TO_DEG_TFBK_MULT     ( (TFBK_DEGREES_PER_VOLT_DEF * ANALOG_CONDITIONING_CONTROL_BOARD) * ((ADC_REFERENCE_VOLTAGE_VOLTS)/((uint32_t)1 << ADC_RESULT_BITS)) )

#define ADC_RESULT_TO_DEG_TFBK_OFFS     TFBK_OFFSET_DEGREES  

    

/* 0-5VDAC -> 5-10V Ref Comparator */
/* DAC Reference Coefficients */
#define DAC_RESULT_TO_AMP_IFBK_OFFS         ( DAC_REFERENCE_VOLTAGE_VOLTS / CURRRENT_TO_VOLTAGE_CS_1021_MULT )                                                                          /* 980.392156862745 A (5V; 51k/10k; 1/5000; 5Ohm) */
#define DAC_RESULT_TO_AMP_IFBK_MULT         ( DAC_REFERENCE_VOLTAGE_VOLTS / (((uint32_t)1 << DAC_RESULT_BITS) * CURRRENT_TO_VOLTAGE_CS_1021_MULT) )                                     /* 0.957414 A/DACBit (10 Bits) */

#define DAC_RESULT_TO_AMP_CFBK_OFFS			DAC_RESULT_TO_AMP_IFBK_OFFS
#define DAC_RESULT_TO_AMP_CFBK_MULT			DAC_RESULT_TO_AMP_IFBK_MULT

#define DAC_RESULT_TO_VOLTS_DC_OFFS         ( DAC_REFERENCE_VOLTAGE_VOLTS * VOLTAGE_MEASURE_BOARD_DIVIDER )                                                                             /* 945 V (5V; 12*470k/30k) */
#define DAC_RESULT_TO_VOLTS_DC_MULT         ((DAC_REFERENCE_VOLTAGE_VOLTS * VOLTAGE_MEASURE_BOARD_DIVIDER)/((uint32_t)1 << DAC_RESULT_BITS) )                                           /* 0.9228515625 V/DACBit (10 Bits) */






/* *****************************************************************************
 * Other Configuration Definitions
 **************************************************************************** */

#ifdef PROJECTCFG_HMLIB_HEXMON_UART_MODULE
#define HMLIB_HEXMON_UART_MODULE       PROJECTCFG_HMLIB_HEXMON_UART_MODULE
#else
#define HMLIB_HEXMON_UART_MODULE       UART_1
#endif

#ifdef PROJECTCFG_HMLIB_MODBUS_UART_MODULE
#define HMLIB_MODBUS_UART_MODULE       PROJECTCFG_HMLIB_MODBUS_UART_MODULE
#else
#define HMLIB_MODBUS_UART_MODULE       UART_1
#endif


#define HMLIB_MODBUS_DEBUG_RESPONSES                    0

#if HMLIB_HEXMON_UART_MODULE != HMLIB_MODBUS_UART_MODULE
#define HMLIB_MODBUS_AND_HEXMON_UART_MODULE_DIFFERENT   1
#else
#define HMLIB_MODBUS_AND_HEXMON_UART_MODULE_DIFFERENT   0
#endif



#define SPI_RAM_HZ      		PROJECTCFG_SPI_RAM_HZ
#define SPI_EEPROM_HZ    		PROJECTCFG_SPI_EEPROM_HZ
#define SPI_FLIR_HZ     		PROJECTCFG_SPI_FLIR_HZ

#define SPI_DAC_HZ              PROJECTCFG_SPI_DAC_HZ

#define SPI_PRESCALER(frequency)    (uint16_t)((FCY_HZ / frequency) + 0.0) /* no roundup - here is set the maximum frequency */

#define EXT_MEM_SPI_MODULE      SPI_2
#define EXT_MEM_SPI_DMA_TX      DMA_0
#define EXT_MEM_SPI_DMA_RX      DMA_1

#define DAC_SPI_MODULE          SPI_1

#define EXT_MEM_PMP_DMA         DMA_2





#define PMP_USE_DMA             1       /* use dma only if freemaster used of fix while(busy) loops */
#define PMP_BUS_SIZE_BYTES      1       /* 1 or 2 bytes select */

#define USE_IN_FPGA_CS_DELAY_INSTEAD_OF_PMALL_AND_PMALH_STROBES 1   /* TSC Board */




/* *****************************************************************************
 * Interrupt Priority Definitions
 **************************************************************************** */

