devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP128GM706/boardcfg_128GM706.h
#define ISR_PRIORITY_UARTSRX    5
#define ISR_PRIORITY_UARTSTX    5
#define ISR_PRIORITY_UARTSERR   5

#define ISR_PRIORITY_TMR1       7


#define ISR_PRIORITY_PWMADC_CRITICAL    6

#if BOARDCFG_USE_OLD_NON_MCC_ADC
#define ISR_PRIORITY_ADC1       ISR_PRIORITY_PWMADC_CRITICAL
#define ISR_PRIORITY_ADC2       ISR_PRIORITY_PWMADC_CRITICAL
#else
#define ISR_PRIORITY_ADC1       2
#define ISR_PRIORITY_ADC2       2
#endif
 
#define ISR_PRIORITY_PWMSEVTIP  ISR_PRIORITY_PWMADC_CRITICAL
#define ISR_PRIORITY_PWMSSEVTIP ISR_PRIORITY_PWMADC_CRITICAL

#define ISR_PRIORITY_PWM1TO6    ISR_PRIORITY_PWMADC_CRITICAL    /* Phase Shifting and trigger for shifted modes. Shifted modes must have the same ISR_PRIORITY_PWMADC_CRITICAL */
#define ISR_PRIORITY_PWM1       ISR_PRIORITY_PWM1TO6
#define ISR_PRIORITY_PWM2       ISR_PRIORITY_PWM1TO6
#define ISR_PRIORITY_PWM3       ISR_PRIORITY_PWM1TO6
#define ISR_PRIORITY_PWM4       ISR_PRIORITY_PWM1TO6
#define ISR_PRIORITY_PWM5       ISR_PRIORITY_PWM1TO6
#define ISR_PRIORITY_PWM6       ISR_PRIORITY_PWM1TO6

#define ISR_PRIORITY_PWM7       2   /* At least One Level Less than PWM ADC Criticals */

#define ISR_PRIORITY_I2C1       4
#define ISR_PRIORITY_I2C2       4

#define ISR_PRIORITY_SPIRXDMA   4       /* SPI Transfer ISR Priority */
#define ISR_PRIORITY_SPITXDMA   4

#define ISR_PRIORITY_SPITRANS   4       /* SPI Transfer ISR Priority */
#define ISR_PRIORITY_SPIERROR   4       /* SPI Error ISR Priority */       

#define ISR_PRIORITY_INCAP1     3
#define ISR_PRIORITY_INCAP2     3

#define ISR_PRIORITY_TMR7       1   /* input capture use */
#define ISR_PRIORITY_TMR9       1

/* *****************************************************************************
 * Pin Definitions
 **************************************************************************** */
/* *****************************************************************************
 * PPS
 **************************************************************************** */
#if defined __dsPIC33EP512MU814__
#define U1TX_PIN_PPS _RP113R            //RP as U1TX   G1
#define U1RX_PIN_PPS 31                 //RP as U1RX   A15
#define U2TX_PIN_PPS _RP112R            //RP as U2TX   G0
#define U2RX_PIN_PPS 30                 //RP as U2RX   A14
#define U3TX_PIN_PPS _RP127R            //RP as U3TX   G15
#define U3RX_PIN_PPS 121                //RP as U3RX   G9
#define U4TX_PIN_PPS _RP71R             //RP as U4TX   D7
#define U4RX_PIN_PPS 72                 //RP as U4RX   D8
#elif defined __dsPIC33EP512GM710__
#define U1TX_PIN_PPS _RP127R            //RP as U1TX   G15
#define U1RX_PIN_PPS 124                //RP as U1RX   G12
#define U2TX_PIN_PPS _RP38R             //RP as U2TX   B6
#define U2RX_PIN_PPS 37                 //RP as U2RX   B5
#define U3TX_PIN_PPS _RP39R             //RP as U3TX   B7
#define U3RX_PIN_PPS 61                 //RP as U3RX   C13   
#elif defined __dsPIC33EP128GM706__
#define U1TX_PIN_PPS _RP70R             //RP as U1TX   D6
#define U1RX_PIN_PPS 72                 //RP as U1RX   D8
#else
#error "define pins if needed"
#endif

/* *****************************************************************************
 * Other Peripheral Auxiliary - Enable, Open Drain and Chip Select
 **************************************************************************** */

#if USE_I2C1
#define I2C1_SDA_SetOpenDrain()       { ODCCbits.ODCC4  = 1; }
#define I2C1_SCL_SetOpenDrain()       { ODCCbits.ODCC5  = 1; }
#endif

#if USE_I2C2
#define I2C2_SDA_SetOpenDrain()       { ODCAbits.ODCA8  = 1; }
#define I2C2_SCL_SetOpenDrain()       { ODCBbits.ODCB4  = 1; }
#endif


#if USE_SPI_RAM
#define CS_RAM_SetHigh()   /* { CS1_SPI1_SetHigh(); } */
#define CS_RAM_SetLow()    /* { CS1_SPI1_SetLow();  } */        /* RAM */
#endif

#if USE_SPI_EEPROM
#define CS_EEPROM_SetHigh()/* { CS1_SPI1_SetHigh(); } */
#define CS_EEPROM_SetLow() /* { CS1_SPI1_SetLow();  } */         /* EEPROM */
#endif

#if USE_SPI_FPGA
#define CS_FPGA_SetHigh()  /* { CS1_SPI1_SetHigh(); } */
#define CS_FPGA_SetLow()   /* { CS1_SPI1_SetLow();  } */         /* FPGA  */
#endif

#if USE_SPI_DAC
#define LD_DAC_SetHigh()  /* { CS1_SPI1_SetHigh(); } */
#define LD_DAC_SetLow()   /* { CS1_SPI1_SetLow();  } */
#endif

#if USE_SPI_FLIR
#define CS_FLIR_SetHigh()  /* { CS1_SPI1_SetHigh(); } */
#define CS_FLIR_SetLow()   /* { CS1_SPI1_SetLow();  } */         /* FLIR CAMERA  */

#define FLIR_RESET_SetHigh()  /* { FLIR_RST_SetHigh(); } */
#define FLIR_RESET_SetLow()   /* { FLIR_RST_SetLow();  } */      /* FLIR CAMERA Reset Pin - Must Be Configured As Open Drain  */

#define FLIR_VSYNC_GetValue() /* FLIR_VSYNC_GetValue() */
#endif



/* *****************************************************************************
 * Function Definitions 
 **************************************************************************** */

#define BOARDCFG_USE_FUNCTION_PINS 0

#if BOARDCFG_USE_FUNCTION_PINS
#define FUNC_NONE 0
#define FUNC_INPUT 1
#define FUNC_OUTPUT 2
#define FUNC_DEBUG 3
#define FUNC_INIT_OUTPUT 4

/* Forced Func Initialization */
#define USE_TSC_F0       FUNC_DEBUG
#define USE_TSC_F1       FUNC_OUTPUT    /* SSR */        
#define USE_TSC_F2       FUNC_NONE         
#define USE_TSC_F3       FUNC_NONE 
#define USE_TSC_F4       FUNC_NONE 
#define USE_TSC_F5       FUNC_NONE 
#define USE_TSC_F6       FUNC_NONE 
#define USE_TSC_F7       FUNC_NONE 
#define USE_TSC_F8       FUNC_NONE          /* Used For CS2_EEPROM */
#define USE_TSC_F9       FUNC_NONE          /* Used For CS2_RAM */
#define USE_TSC_F10      FUNC_INIT_OUTPUT   /* Has Pull Up - used as output to reset FPGA's Error */
#define USE_TSC_F11      FUNC_DEBUG         /* Has Pull Up */
#define USE_TSC_F12      FUNC_INPUT         /* Has Pull Up */
#define USE_TSC_F13      FUNC_NONE          /* Used For PGED */
#define USE_TSC_F14      FUNC_NONE          /* Used For PGEC */

#endif



/* *****************************************************************************
 * Debug Definitions 
 **************************************************************************** */


#define DEBUG_SET_USART1_RX()   
#define DEBUG_CLR_USART1_RX()   

