devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP128GM706/boardcfg_128GM706.h
#define DEBUG_SET_USART2_RX()   
#define DEBUG_CLR_USART2_RX()   
        
#define DEBUG_SET_USART3_RX()   
#define DEBUG_CLR_USART3_RX()   
 
#define DEBUG_SET_USART4_RX()   
#define DEBUG_CLR_USART4_RX()   

        
#define DEBUG_SET_USART1_ERR()  
#define DEBUG_CLR_USART1_ERR()  

#define DEBUG_SET_USART2_ERR()  
#define DEBUG_CLR_USART2_ERR()  

#define DEBUG_SET_USART3_ERR()  
#define DEBUG_CLR_USART3_ERR()  
        
#define DEBUG_SET_USART4_ERR()  
#define DEBUG_CLR_USART4_ERR()  


#define DEBUG_SET_USART1_TX()   
#define DEBUG_CLR_USART1_TX()   

#define DEBUG_SET_USART2_TX()   
#define DEBUG_CLR_USART2_TX()   
    
#define DEBUG_SET_USART3_TX()   
#define DEBUG_CLR_USART3_TX()   

#define DEBUG_SET_USART4_TX()   
#define DEBUG_CLR_USART4_TX()   


#define DEBUG_SET_TMR_1()       
#define DEBUG_CLR_TMR_1()       
        

#define DEBUG_SET_ADC_1()       OUT_CTR3_RB5_RB6_SetHigh() 
#define DEBUG_CLR_ADC_1()       OUT_CTR3_RB5_RB6_SetLow()         

#define DEBUG_SET_ADC_2()       OUT_CTR4_RB6_RB7_SetHigh()           
#define DEBUG_CLR_ADC_2()       OUT_CTR4_RB6_RB7_SetLow()        


#define DEBUG_SET_PWM_PSEV()
#define DEBUG_CLR_PWM_PSEV()

#define DEBUG_SET_PWM_SSEV()    OUT_CTR6_RB8_RB9_SetHigh()    
#define DEBUG_CLR_PWM_SSEV()    OUT_CTR6_RB8_RB9_SetLow()    

#define DEBUG_SET_PWM_1TO6()    
#define DEBUG_CLR_PWM_1TO6()    

#define DEBUG_SET_PWM_7()       
#define DEBUG_CLR_PWM_7()       


#define DEBUG_SET_MAIN()        OUT_CTR2_RB4_RB5_SetHigh() 
#define DEBUG_CLR_MAIN()        OUT_CTR2_RB4_RB5_SetLow() 


#define DEBUG_SET_MAIN2()       OUT_CTR5_RB7_RB8_SetHigh()      
#define DEBUG_CLR_MAIN2()       OUT_CTR5_RB7_RB8_SetLow()      


#define DEBUG_SET_CTRL()        OUT_CTR1_RB3_RB4_SetHigh()     
#define DEBUG_CLR_CTRL()        OUT_CTR1_RB3_RB4_SetLow()      





/* *****************************************************************************
 * Function Prototypes
 **************************************************************************** */
#endif	/* BOARDCFG_H */
